import 'package:cmu_mobile_app/models/quiz_model.dart';

List<QuizModel> selfWorthList = [
  QuizModel(
    quiz: "โดยทั่วไปฉันรู้สึกพอใจในตนเอง",
    choice: [
      "เห็นด้วยอย่างยิ่ง",
      "เห็นด้วย",
      "ไม่เห็นด้วย",
      "ไม่เห็นด้วยอย่างยิ่ง"
    ],
    selecteChoice: 0,
  ),
  QuizModel(
    quiz: "บ่อยครั้งที่ฉันคิดว่าตัวเองไม่มีอะไรดีเลย",
    choice: [
      "เห็นด้วยอย่างยิ่ง",
      "เห็นด้วย",
      "ไม่เห็นด้วย",
      "ไม่เห็นด้วยอย่างยิ่ง"
    ],
    selecteChoice: 0,
  ),
  QuizModel(
    quiz: "ฉันรู้สึกว่าตัวฉันเองก็มีอะไรดีๆเหมือนกัน",
    choice: [
      "เห็นด้วยอย่างยิ่ง",
      "เห็นด้วย",
      "ไม่เห็นด้วย",
      "ไม่เห็นด้วยอย่างยิ่ง"
    ],
    selecteChoice: 0,
  ),
  QuizModel(
    quiz: "ฉันสามารถทําอะไรได้ดีเหมือนๆกับคนอื่น",
    choice: [
      "เห็นด้วยอย่างยิ่ง",
      "เห็นด้วย",
      "ไม่เห็นด้วย",
      "ไม่เห็นด้วยอย่างยิ่ง"
    ],
    selecteChoice: 0,
  ),
  QuizModel(
    quiz: "ฉันรู้สึกว่าตนเองไม่มีอะไรน่าภาคภูมิใจนัก",
    choice: [
      "เห็นด้วยอย่างยิ่ง",
      "เห็นด้วย",
      "ไม่เห็นด้วย",
      "ไม่เห็นด้วยอย่างยิ่ง"
    ],
    selecteChoice: 0,
  ),
  QuizModel(
    quiz: "ฉันรู้สึกบ่อยๆว่าตนเองไร้ค่า",
    choice: [
      "เห็นด้วยอย่างยิ่ง",
      "เห็นด้วย",
      "ไม่เห็นด้วย",
      "ไม่เห็นด้วยอย่างยิ่ง"
    ],
    selecteChoice: 0,
  ),
  QuizModel(
    quiz: "ฉันรู้สึกว่าตนเองมีคุณค่าอย่างน้อยสุดก็เท่าๆกับคนอื่น",
    choice: [
      "เห็นด้วยอย่างยิ่ง",
      "เห็นด้วย",
      "ไม่เห็นด้วย",
      "ไม่เห็นด้วยอย่างยิ่ง"
    ],
    selecteChoice: 0,
  ),
  QuizModel(
    quiz: "ฉันอยากจะภาคภูมิใจในตนเองมากกว่านี้",
    choice: [
      "เห็นด้วยอย่างยิ่ง",
      "เห็นด้วย",
      "ไม่เห็นด้วย",
      "ไม่เห็นด้วยอย่างยิ่ง"
    ],
    selecteChoice: 0,
  ),
  QuizModel(
    quiz: "โดยรวมแล้วฉันมีความรู้สึกว่าตนเองล้มเหลว",
    choice: [
      "เห็นด้วยอย่างยิ่ง",
      "เห็นด้วย",
      "ไม่เห็นด้วย",
      "ไม่เห็นด้วยอย่างยิ่ง"
    ],
    selecteChoice: 0,
  ),
  QuizModel(
    quiz: "ฉันมีความรู้สึกที่ดีกับตนเอง",
    choice: [
      "เห็นด้วยอย่างยิ่ง",
      "เห็นด้วย",
      "ไม่เห็นด้วย",
      "ไม่เห็นด้วยอย่างยิ่ง"
    ],
    selecteChoice: 0,
  ),
];

List<QuizModel> alcoholAssessmentList = [
  QuizModel(
    quiz: "1. คุณดื่มสุราบ่อยเพียงไร",
    choice: [
      "ไม่เคยเลย",
      "เดือนละครั้งหรือ น้อยกว่า",
      "2-4 ครั้งต่อเดือน",
      "2-3 ครั้งต่อสัปดาห์",
      "4 ครั้งขึ้นไปต่อสัปดาห์",
    ],
    selecteChoice: 0,
  ),
  QuizModel(
    quiz:
        "2.เลือกตอบเพียงข้อเดียวเวลาที่คุณดื่มสุรา \n  2.1 โดยทั่วไปแล้วคุณดื่มประมาณเท่าไหร่ต่อวัน",
    choice: [
      "1-2ดื่มมาตรฐาน",
      "3-4ดื่มมาตรฐาน",
      "5-6ดื่มมาตรฐาน",
      "7-9ดื่มมาตรฐาน",
      "ตั้งแต่ 10 ดื่มมาตราฐานขึ้นไป",
    ],
    selecteChoice: 0,
  ),
  QuizModel(
    quiz:
        "2.2 โดยทั่วไปดื่มเบียร์ เช่น สิงห์ ไฮเนเกน ลีโอ เชียร์ ไทเกอร์ ช้าง ดื่มประมาณเท่าไรต่อวัน หรือ ถ้าโดยทั่วไปดื่มเหล้า เช่น แม่โขง หงส์ทอง หงส์ทิพย์ เหล้าขาว 40 ดีกรี ดื่มประมาณเท่าไร ต่อวัน",
    choice: [
      "1-1.5 กระป่อง/1/2-3/4 ขวด",
      "2-3 กระป๋อง/1-1.5 ขวด",
      "3.5-4 กระป๋อง/2 ขวด",
      "4.5-7 กระป๋อง/3-4 ขวด",
      "7 กระป๋อง/4 ขวดขึ้นไป",
    ],
    selecteChoice: 0,
  ),
  QuizModel(
    quiz:
        "2.3 โดยทั่วไปดื่มเหล้า เช่น แม่โขง หงส์ทอง หงส์ทิพย์ เหล้าขาว 40 ดีกรี ดื่มประมาณเท่าไร ต่อวัน",
    choice: [
      "2-3 ฝา",
      "¼ แบน",
      "½ แบน",
      "¾ แบน",
      "1 แบนขึ้นไป",
    ],
    selecteChoice: 0,
  ),
  QuizModel(
    quiz:
        "3. บ่อยครั้งเพียงไรที่คุณดื่มเบียร์ 4 กระป๋องขึ้นไป หรือเหล้าวิสกี้ 3 เป๊กขึ้นไป",
    choice: [
      "ไม่เคยเลย",
      "น้อยกว่าเดือนละครั้ง",
      "เดือนละครั้ง",
      "สัปดาห์ละครั้ง",
      "ทุกวัน หรือ เกือบทุกวัน",
    ],
    selecteChoice: 0,
  ),
  QuizModel(
    quiz:
        "4. ในช่วงหนึ่งปีที่แล้ว มีบ่อยครั้งเพียงไรที่คุณพบว่าคุณไม่สามารถหยุดดื่มได้ หากคุณได้เริ่มดื่มไปแล้ว",
    choice: [
      "ไม่เคยเลย",
      "น้อยกว่าเดือนละครั้ง",
      "เดือนละครั้ง",
      "สัปดาห์ละครั้ง",
      "ทุกวัน หรือ เกือบทุกวัน",
    ],
    selecteChoice: 0,
  ),
  QuizModel(
    quiz:
        "5. ในช่วงหนึ่งปีที่แล้ว มีบ่อยเพียงไรที่คุณไม่ได้ทำสิ่งที่คุณควรจะทำตาม ปกติ เพราะคุณมัวแต่ไปดื่มสุราเสีย",
    choice: [
      "ไม่เคยเลย",
      "น้อยกว่าเดือนละครั้ง",
      "เดือนละครั้ง",
      "สัปดาห์ละครั้ง",
      "ทุกวัน หรือ เกือบทุกวัน",
    ],
    selecteChoice: 0,
  ),
  QuizModel(
    quiz:
        "6. ในช่วงหนึ่งปีที่แล้ว มีบ่อยเพียงไรที่คุณต้องรีบดื่มสุราทันทีในตอนเช้า เพื่อจะได้ดำเนินชีวิตตามปกติ หรือถอนอาการเมาค้างจากการดื่มหนักในคืนที่ผ่านมา",
    choice: [
      "ไม่เคยเลย",
      "น้อยกว่าเดือนละครั้ง",
      "เดือนละครั้ง",
      "สัปดาห์ละครั้ง",
      "ทุกวัน หรือ เกือบทุกวัน",
    ],
    selecteChoice: 0,
  ),
  QuizModel(
    quiz:
        "7. ในช่วงหนึ่งปีที่แล้ว มีบ่อยเพียงไรที่คุณรู้สึกไม่ดี โกรธหรือเสียใจ เนื่องจาก คุณได้ทำบางสิ่งบางอย่างลงไปในขณะ ที่คุณดื่มสุราเข้าไป",
    choice: [
      "ไม่เคยเลย",
      "น้อยกว่าเดือนละครั้ง",
      "เดือนละครั้ง",
      "สัปดาห์ละครั้ง",
      "ทุกวัน หรือ เกือบทุกวัน",
    ],
    selecteChoice: 0,
  ),
  QuizModel(
    quiz:
        "8. ในช่วงปีที่แล้ว มีบ่อยเพียงไรที่คุณไม่สามารถจำได้ว่าเกิดอะไรขึ้นในคืนที่ผ่านมา เพราะว่าคุณได้ดื่มสุราเข้าไป",
    choice: [
      "ไม่เคยเลย",
      "น้อยกว่าเดือนละครั้ง",
      "เดือนละครั้ง",
      "สัปดาห์ละครั้ง",
      "ทุกวัน หรือ เกือบทุกวัน",
    ],
    selecteChoice: 0,
  ),
  QuizModel(
    quiz:
        "9. ตัวคุณเองหรือคนอื่น เคยได้รับบาดเจ็บซึ่งเป็นผลจากการดื่มสุราของคุณหรือไม่",
    choice: [
      "ไม่เคยเลย",
      "เคย แต่ไม่ได้เกิด ขึ้นในปีที่แล้ว",
      "เคยเกิดขึ้นในช่วงหนึ่งปีที่แล้ว",
    ],
    selecteChoice: 0,
  ),
  QuizModel(
    quiz:
        "10. เคยมีแพทย์หรือบุคลากรทาง การแพทย์หรือเพื่อนฝูงหรือญาติพี่น้อง แสดงความเป็นห)วงเป็นใยต่อการดื่ม สุราของคุณหรือไม่",
    choice: [
      "ไม่เคยเลย",
      "เคย แต่ไม่ได้เกิด ขึ้นในปีที่แล้ว",
      "เคยเกิดขึ้นในช่วงหนึ่งปีที่แล้ว",
    ],
    selecteChoice: 0,
  ),
];
