List<String> activity1 = [
  //activity 1
  "กิจกรรมที่ 1 ความรู้เกี่ยวกับเครื่องดื่มแอลกอฮอล์ ผลกระทบจากการดื่ม",
  "ความรู้เกี่ยวกับเครื่องดื่มแอลกอฮอล์",
  "teen/activity_1_2.mp4",
  "teen/activity_1_1.mp4",
  "ความรู้เกี่ยวกับเครื่องดื่มแอลกอฮอล์",
];
List<String> activity2 = [
  //activity 2
  "กิจกรรมที่ 2 กฏหมายที่เกี่ยวข้องกับเครื่องดื่มแอลกอฮอล์",
  "ความรู้เกี่ยวกับกฏหมายควบคุมเครื่องดื่มแอลกอฮอล์",
  "teen/activity_2.mp4",
  "ความรู้เกี่ยวกับกฏหมายควบคุมเครื่องดื่มแอลกอฮอล์",
];
List<String> activity3 = [
  //activity 3
  "กิจกรรมที่ 3 การเปลี่ยนแปลงและพัฒนาการของวัยรุ่น สาเหตุการดื่มแอลกอฮอล์ของวัยรุ่น",
  "ความรู้เกี่ยวกับพัฒนาการของวัยรุ่น",
  "teen/activity_3.mp4",
  "ความรู้เกี่ยวกับพัฒนาการของวัยรุ่น",
];
List<String> activity4 = [
  //activity 4
  "กิจกรรมที่ 4 ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการตัดสินใจ",
  "teen/activity_4_1.mp4",
  "teen/activity_4_2.mp4",
  "แบบสะท้อนการเรียนรู้ของวัยรุ่น&&กิจกรรมที่ 4 ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการตัดสินใจ",
];
List<String> activity5 = [
  //activity 5
  "กิจกรรมที่ 5 ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการควบคุมอารมณ์",
  "การกำกับติดตามและประเมินผลการทำกิจกรรมที่ 4&&เรื่อง ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการตัดสินใจ",
  "teen/activity_5_1.mp4",
  "teen/activity_5_2.mp4",
  "แบบสะท้อนการเรียนรู้ของวัยรุ่น&&เรื่องทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการควบคุมอารมณ์",
];
List<String> activity6 = [
  //activity 6
  "กิจกรรมที่ 6 ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการปฏิเสธ",
  "การกำกับติดตามและประเมินผลการทำกิจกรรมที่ 5&&เรื่อง ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการควบคุมอารมณ์",
  "teen/activity_6_1.mp4",
  "teen/activity_6_2.mp4",
  "แบบสะท้อนการเรียนรู้ของวัยรุ่น&&เรื่อง ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการปฏิเสธ",
];
List<String> activity7 = [
  //activity 7
  "กิจกรรมที่ 7 ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการผ่อนคลายความเครียด",
  "การกำกับติดตามและประเมินผลการทำกิจกรรมที่ 6&&เรื่อง ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการปฏิเสธ",
  "teen/activity_7_1.mp4",
  "teen/activity_7_2.mp4",
  "แบบสะท้อนการเรียนรู้ของวัยรุ่น&&เรื่อง ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการผ่อนคลายความเครียด",
];
List<String> activity8 = [
  //activity 8
  "กิจกรรมที่ 8 คุณธรรมสำคัญอย่างไร: หลักพรหมวิหาร 4 ความเมตตา กรุณา",
  "การกำกับติดตามและประเมินผลการทำกิจกรรมที่ 7&&เรื่อง ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการผ่อนคลายความเครียด",
  "teen/activity_8_1.mp4",
  "teen/activity_8_2.mp4",
  "แบบสะท้อนการเรียนรู้ของวัยรุ่น&&เรื่อง หลักพรหมวิหาร 4 ความเมตตา กรุณา",
];
List<String> activity9 = [
  //activity 9
  "กิจกรรมที่ 9 คุณธรรมสำคัญอย่างไร: หลักพรหมวิหาร 4 มุทิตา อุเบกขา",
  "การกำกับติดตามและประเมินผลการทำกิจกรรมที่ 8&&เรื่อง คุณธรรมสำคัญอย่างไร: หลักพรหมวิหาร 4 ความเมตตา กรุณา",
  "teen/activity_9_1.mp4",
  "teen/activity_9_2.mp4",
  "แบบสะท้อนการเรียนรู้ของวัยรุ่น&&เรื่อง หลักพรหมวิหาร 4 มุทิตา อุเบกขา",
];
List<String> activity10 = [
  //activity 10
  "กิจกรรมที่ 10 เรื่อง การเห็นคุณค่าในตัวเอง",
  "การกำกับติดตามและประเมินผลการทำกิจกรรมที่ 9&&เรื่อง คุณธรรมสำคัญอย่างไร: หลักพรหมวิหาร 4 มุทิตา อุเบกขา",
  "teen/activity_10.mp4",
  "แบบวัดความมีคุณค่าในตนเอง",
  "แบบสะท้อนการเรียนรู้ของวัยรุ่น&&เรื่อง การเห็นคุณค่าในตัวเอง",
];

List<String> timelineActivity = [
  "แบบสอบถาม",
  "พฤติกรรมการดื่มเครื่องดื่มแอลกอฮอล์",
  "แบบประเมินปัญหาการดื่มสุรา (AUDIT)",
  "แบบวัดความรู้เกี่ยวกับเครื่องดื่มแอลกอฮอล์",
  "แบบวัดทัศนคติต่อการดื่มเครื่องดื่มแอลกอฮอล์",
  "แบบสอบถามการรับรู้สมรรถนะแห่งตนในการปฏิเสธการดื่มเครื่องดื่มแอลกอฮอล์",
  "แบบสอบถามการควบคุมและการส่งเสริมการดื่มเครื่องดื่มแอลกอฮอล์ของพ่อแม่",
  "แบบวัดความตั้งใจในการไม่ดื่มเครื่องดื่มแอลกอฮอล์",
];
////////////-----------------------parent-----------------------
List<String> parent1 = [
  //activity 1
  "กิจกรรมครั้งที่ 1 ความรู้เกี่ยวกับเครื่องดื่มแอลกอฮอล์ ผลกระทบจากการดื่ม",
  "parent/activity_1_1.mp4",
  "parent/activity_1_2.mp4",
];
List<String> parent2 = [
  //activity 2
  "กิจกรรมครั้งที่ 2 กฏหมายที่เกี่ยวข้องกับเครื่องดื่มแอลกอออล์",
  "parent/activity_2.mp4",
];
List<String> parent3 = [
  //activity 3
  "กิจกรรมครั้งที่ 3 การเปลี่ยนแปลงและพัฒนาการของวัยรุ่น สาเหตุการดื่ม แอลกอฮอล์ของวัยรุ่น",
  "parent/activity_3.mp4",
];
List<String> parent4 = [
  //activity 4
  "กิจกรรมครั้งที่ 4 ทักษะชีวิตพิชิตแอลกอฮอล์ : ทักษะการตัดสินใจ",
  "parent/activity_4_1.mp4",
  "parent/activity_4_2.mp4",
  "แบบสะท้อนการเรียนรู้ของผู้ปกครอง&&กิจกรรมครั้งที่ 4 ทักษะชีวิตพิชิตแอลกอฮอล์ : ทักษะการตัดสินใจ"
];
List<String> parent5 = [
  //activity 5
  "กิจกรรมครั้งที่ 5 ทักษะชีวิตพิชิตแอลกอฮอล์ : ทักษะการควบคุมอารมณ์",
  "parent/activity_5_1.mp4",
  "parent/activity_5_2.mp4",
  "สะท้อนการเรียนรู้ กิจกรรมที่ 5 ทักษะการควบคุมอารมณ์&&กิจกรรมครั้งที่ 5 ทักษะชีวิตพิชิตแอลกอฮอล์ : ทักษะการควบคุมอารมณ์",
  "การกํากับติดตามและประเมินผลการทํากิจกรรมที่ 4 ทักษะการตัดสินใจ&&กิจกรรมครั้งที่ 4 ทักษะชีวิตพิชิตแอลกอฮอล์ : ทักษะการตัดสินใจ"
];
List<String> parent6 = [
  //activity 6
  "กิจกรรมครั้งที่ 6 ทักษะชีวิตพิชิตแอลกอฮอล์ : ทักษะการปฏิเสธ",
  "parent/activity_6_1.mp4",
  "parent/activity_6_2.mp4",
  "สะท้อนการเรียนรู้ กิจกรรมที่ 6 ทักษะการปฏิเสธ&&กิจกรรมครั้งที่ 6 ทักษะชีวิตพิชิตแอลกอฮอล์ : ทักษะการปฏิเสธ",
  "การกํากับติดตามและประเมินผลการทํากิจกรรมที่ 5 ทักษะการควบคุมอารมณ์&&กิจกรรมครั้งที่ 5 ทักษะชีวิตพิชิตแอลกอฮอล์ : ทักษะการควบคุมอารมณ์"
];
List<String> parent7 = [
  //activity 7
  "กิจกรรมครั้งที่ 7 ทักษะชีวิตพิชิตแอลกอฮอล์ : ทักษะการผ่อนคลายความเครียด",
  "parent/activity_7_1.mp4",
  "parent/activity_7_2.mp4",
  "สะท้อนการเรียนรู้ กิจกรรมที่ 7 ทักษะการผ่อนคลายความเครียด&&กิจกรรมครั้งที่ 7 ทักษะชีวิตพิชิตแอลกอฮอล์ : ทักษะการผ่อนคลายความเครียด",
  "การกํากับติดตามและประเมินผลการทํากิจกรรมที่ 6 ทักษะการปฏิเสธ&&กิจกรรมครั้งที่ 6 ทักษะชีวิตพิชิตแอลกอฮอล์ : ทักษะการปฏิเสธ"
];
List<String> parent8 = [
  //activity 8
  "กิจกรรมครั้งที่ 8 บทบาทของครอบครัวในการป้องกันการดื่มแอลกอฮอล์ในวัยรุ่น: แบบอย่างที่ดีมีคุณค่าต่อลูกในวัยรุ่น",
  "parent/activity_8.mp4",
  "สะท้อนการเรียนรู้ กิจกรรมที่ 8 แบบอย่างที่ดีมีคุณค่าต่อลูกในวัยรุ่น&&กิจกรรมครั้งที่ 8 บทบาทของครอบครัวในการป้องกันการดื่มแอลกอฮอล์ในวัยรุ่น: แบบอย่างที่ดีมีคุณค่าต่อลูกในวัยรุ่น",
  "การกํากับติดตามและประเมินผลการทํากิจกรรมที่ 7 ทักษะการผ่อนคลายความเครียด&&กิจกรรมครั้งที่ 7 ทักษะชีวิตพิชิตแอลกอฮอล์ : ทักษะการผ่อนคลายความเครียด"
];
List<String> parent9 = [
  //activity 9
  "กิจกรรมครั้งที่ 9 การสร้างครอบครัวให้เป็นเกราะป้องกันเครื่องดื่มแอลกอฮอล์",
  "parent/activity_9.mp4",
  "สะท้อนการเรียนรู้ กิจกรรมที่ 9 การสร้างครอบครัวให้เป็นเกราะป้องกันเครื่องดื่มแอลกอฮอล์&&กิจกรรมครั้งที่ 9 การสร้างครอบครัวให้เป็นเกราะป้องกันเครื่องดื่มแอลกอฮอล์",
  "การกํากับติดตามและประเมินผลการทํากิจกรรมที่ 8 แบบอย่างที่ดีมีคุณค่าต่อลูกในวัยรุ่น&&กิจกรรมครั้งที่ 8 บทบาทของครอบครัวในการป้องกันการดื่มแอลกอฮอล์ในวัยรุ่น: แบบอย่างที่ดีมีคุณค่าต่อลูกในวัยรุ่น"
];
List<String> parent10 = [
  //activity 10
  "กิจกรรมครั้งที่ 10 บทบาทของครอบครัวในการป้องกันการดื่มแอลกอฮอล์ในวัยรุ่น: ส่ือสารอย่างไร ลูกห่างไกลจากแอลกอฮออล์",
  "parent/activity_10.mp4",
  "สะท้อนการเรียนรู้ กิจกรรมที่ 10 ส่ือสารอย่างไร ลูกห่างไกลจากแอลกอฮออล์&&กิจกรรมครั้งที่ 10 บทบาทของครอบครัวในการป้องกันการดื่มแอลกอฮอล์ในวัยรุ่น: ส่ือสารอย่างไร ลูกห่างไกลจากแอลกอฮออล์",
  "การกํากับติดตามและประเมินผลการทํากิจกรรมที่ 9 การสร้างครอบครัวให้เป็นเกราะป้องกันเครื่องดื่มแอลกอฮอล์&&กิจกรรมครั้งที่ 9 การสร้างครอบครัวให้เป็นเกราะป้องกันเครื่องดื่มแอลกอฮอล์"
];
List<String> parent11 = [
  //activity 11
  "การทําแบบประเมินปํญหาการดื่มสุรา (AUDIT)",
  "การกํากับติดตามและประเมินผลการทํากิจกรรมที่ 10 ส่ือสารอย่างไร ลูกห่างไกลจากแอลกอฮออล์&&กิจกรรมครั้งที่ 10 บทบาทของครอบครัวในการป้องกันการดื่มแอลกอฮอล์ในวัยรุ่น: ส่ือสารอย่างไร ลูกห่างไกลจากแอลกอฮออล์"
];
