List<String> activity1 = [
  //activity 1
  "กิจกรรมที่ 1 ความรู้เกี่ยวกับเครื่องดื่มแอลกอฮอล์ ผลกระทบจากการดื่ม",
  "ความรู้เกี่ยวกับเครื่องดื่มแอลกอฮอล์",
  "assets/video/teen/activity_1_1.mp4",
  "assets/video/teen/activity_1_2.mp4",
  "ความรู้เกี่ยวกับเครื่องดื่มแอลกอฮอล์",
];
List<String> activity2 = [
  //activity 2
  "กิจกรรมที่ 2 กฏหมายที่เกี่ยวข้องกับเครื่องดื่มแอลกอฮอล์",
  "ความรู้เกี่ยวกับกฏหมายควบคุมเครื่องดื่มแอลกอฮอล์",
  "assets/video/teen/activity_2.mp4",
  "ความรู้เกี่ยวกับกฏหมายควบคุมเครื่องดื่มแอลกอฮอล์",
];
List<String> activity3 = [
  //activity 3
  "กิจกรรมที่ 3 การเปลี่ยนแปลงและพัฒนาการของวัยรุ่น สาเหตุการดื่มแอลกอฮอล์ของวัยรุ่น",
  "ความรู้เกี่ยวกับพัฒนาการของวัยรุ่น",
  "assets/video/teen/activity_3.mp4",
  "ความรู้เกี่ยวกับพัฒนาการของวัยรุ่น",
];
List<String> activity4 = [
  //activity 4
  "กิจกรรมที่ 4 ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการตัดสินใจ",
  "assets/video/teen/activity_4_1.mp4",
  "assets/video/teen/activity_4_2.mp4",
  "แบบสะท้อนการเรียนรู้ของวัยรุ่น&&กิจกรรมที่ 4 ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการตัดสินใจ",
];
List<String> activity5 = [
  //activity 5
  "กิจกรรมที่ 5 ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการควบคุมอารมณ์",
  "assets/video/teen/activity_5_1.mp4",
  "assets/video/teen/activity_5_2.mp4",
  "แบบสะท้อนการเรียนรู้ของวัยรุ่น&&กิจกรรมที่ 5 ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการควบคุมอารมณ์",
  "การกำกับติดตามและประเมินผลการทำกิจกรรมที่ 4&&กิจกรรมที่ 4 ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการตัดสินใจ",
];
List<String> activity6 = [
  //activity 6
  "กิจกรรมที่ 6 ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการปฏิเสธ",
  "assets/video/teen/activity_6_1.mp4",
  "assets/video/teen/activity_6_2.mp4",
  "แบบสะท้อนการเรียนรู้ของวัยรุ่น&&กิจกรรมที่ 6 ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการปฏิเสธ",
  "การกำกับติดตามและประเมินผลการทำกิจกรรมที่ 5&&กิจกรรมที่ 5 ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการควบคุมอารมณ์",
];
List<String> activity7 = [
  //activity 7
  "กิจกรรมที่ 7 ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการผ่อนคลายความเครียด",
  "assets/video/teen/activity_7_1.mp4",
  "assets/video/teen/activity_7_2.mp4",
  "แบบสะท้อนการเรียนรู้ของวัยรุ่น&&กิจกรรมที่ 7 ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการผ่อนคลายความเครียด",
  "การกำกับติดตามและประเมินผลการทำกิจกรรมที่ 6&&กิจกรรมที่ 6 ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการปฏิเสธ",
];
List<String> activity8 = [
  //activity 8
  "กิจกรรมที่ 8 คุณธรรมสำคัญอย่างไร: หลักพรหมวิหาร 4 ความเมตตา กรุณา",
  "assets/video/teen/activity_8_1.mp4",
  "assets/video/teen/activity_8_2.mp4",
  "แบบสะท้อนการเรียนรู้ของวัยรุ่น&&กิจกรรมที่ 8 คุณธรรมสำคัญอย่างไร: หลักพรหมวิหาร 4 ความเมตตา กรุณา",
  "การกำกับติดตามและประเมินผลการทำกิจกรรมที่ 7&&กิจกรรมที่ 7 ทักษะชีวิตพิชิตแอลกอฮอล์: ทักษะการผ่อนคลายความเครียด",
];
List<String> activity9 = [
  //activity 9
  "กิจกรรมที่ 9 คุณธรรมสำคัญอย่างไร: หลักพรหมวิหาร 4 มุทิตา อุเบกขา",
  "assets/video/teen/activity_9_1.mp4",
  "assets/video/teen/activity_9_2.mp4",
  "แบบสะท้อนการเรียนรู้ของวัยรุ่น&&กิจกรรมที่ 9 คุณธรรมสำคัญอย่างไร: หลักพรหมวิหาร 4 มุทิตา อุเบกขา",
  "การกำกับติดตามและประเมินผลการทำกิจกรรมที่ 8&&กิจกรรมที่ 8 คุณธรรมสำคัญอย่างไร: หลักพรหมวิหาร 4 ความเมตตา กรุณา",
];
List<String> activity10 = [
  //activity 10
  "กิจกรรมที่ 10 เรื่อง การเห็นคุณค่าในตัวเอง",
  "assets/video/teen/activity_10.mp4",
  "แบบสะท้อนการเรียนรู้ของวัยรุ่น",
  "แบบวัดความมีคุณค่าในตนเอง&&กิจกรรมที่ 10 เรื่อง การเห็นคุณค่าในตัวเอง",
  "การกำกับติดตามและประเมินผลการทำกิจกรรมที่ 9&&กิจกรรมที่ 9 คุณธรรมสำคัญอย่างไร: หลักพรหมวิหาร 4 มุทิตา อุเบกขา",
];

List<String> timelineActivity = [
  "แบบสอบถาม",
  "พฤติกรรมการดื่มเครื่องดื่มแอลกอฮอล์",
  "แบบประเมินปัญหาการดื่มสุรา (AUDIT)",
  "แบบวัดความรู้เกี่ยวกับเครื่องดื่มแอลกอฮอล์",
  "แบบวัดทัศนคติต่อการดื่มเครื่องดื่มแอลกอฮอล์",
  "แบบสอบถามการรับรู้สมรรถนะแห่งตนในการปฏิเสธการดื่มเครื่องดื่มแอลกอฮอล์",
  "แบบสอบถามการควบคุมและการส่งเสริมการดื่มเครื่องดื่มแอลกอฮอล์ของพ่อแม่",
  "แบบวัดความตั้งใจในการไม่ดื่มเครื่องดื่มแอลกอฮอล์",
];

List<String> parentTimeline = [
  //activity 1
  "กิจกรรมครั้งที่ 1 ความรู้เกี่ยวกับเครื่องดื่มแอลกอฮอล์ ผลกระทบจากการดื่ม",
  "แบบประเมินปัญหาการดื่มสุรา (AUDIT)",
  "assets/video/parent/activity_1_1.mp4",
  "assets/video/parent/activity_1_2.mp4",

  //activity 2
  "กิจกรรมครั้งที่ 2 กฏหมายที่เกี่ยวข้องกับเครื่องดื่มแอลกอออล์",
  "assets/video/parent/activity_2.mp4",

  //activity 3
  "กิจกรรมครั้งที่ 3 การเปลี่ยนแปลงและพัฒนาการของวัยรุ่น สาเหตุการดื่ม แอลกอฮอล์ของวัยรุ่น",
  "assets/video/parent/activity_3.mp4",

  //activity 4
  "กิจกรรมครั้งที่ 4 ทักษะชีวิตพิชิตแอลกอฮอล์ : ทักษะการตัดสินใจ",
  "assets/video/parent/activity_4_1.mp4",
  "assets/video/parent/activity_4_2.mp4",
  "แบบสะท้อนการเรียนรู้ของผู้ปกครอง"
];
